{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "f989c836",
   "metadata": {},
   "source": [
    "В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая — к адресу узла в этой сети. Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и маске сети.\n",
    "\n",
    "Сеть задана IP-адресом 95.112.224.0 и маской сети 255.255.255.128.\n",
    "\n",
    "Сколько в этой сети IP-адресов, в которых правый байт в двоичной записи адреса представляет собой палиндром, то есть читается слева направо и справа налево одинаково?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "e83b7e09",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "8"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from ipaddress import *\n",
    "\n",
    "def f(n):\n",
    "    return str(n) == str(n)[::-1]\n",
    "\n",
    "cnt = 0\n",
    "for i in ip_network('95.112.224.0/255.255.255.128'):\n",
    "    s=''.join(bin(int(i)))\n",
    "    s.zfill(32)\n",
    "    if f(s[24:32]):\n",
    "        cnt +=1\n",
    "\n",
    "cnt"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5635f107",
   "metadata": {},
   "source": [
    "В терминологии сетей ТСР/IР маской сети называют двоичное число, которое показывает, какая часть IP﻿-﻿адреса узла сети относится к адресу сети, а какая — к адресу узла в этой сети. Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и его маске. Широковещательным адресом называется специализированный адрес, в котором на месте нулей в маске стоят единицы. Адрес сети и широковещательный адрес не могут быть использованы для адресации сетевых устройств.\n",
    "\n",
    "Сеть задана IP-адресом одного из входящих в неё узлов 102.162.200.51 и сетевой маской 255.255.255.0.\n",
    "\n",
    "Найдите в данной сети наибольший IP-адрес, который может быть назначен компьютеру. В ответе укажите сумму числовых значений октетов найденного IP-адреса.\n",
    "\n",
    "Например, если бы найденный адрес был равен 100.20.3.4, то в ответе следовало бы записать: 127."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "5ac45120",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "718"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "102+162+200+254"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2f51e7af",
   "metadata": {},
   "source": [
    "В терминологии сетей TCP/IP маска сети — это двоичное число, меньшее \n",
    "2**32\n",
    " ; в маске сначала (в старших разрядах) стоят единицы, а затем с некоторого места нули. Маска определяет, какая часть IP-адреса узла сети относится к адресу сети, а какая — к адресу самого узла в этой сети. Обычно маска записывается по тем же правилам, что и IP-адрес — в виде четырёх байт, причём каждый байт записывается в виде десятичного числа. Адрес сети получается в результате применения поразрядной конъюнкции к заданному IP-адресу узла и маске.\n",
    "\n",
    "Для узла с IP-адресом 215.181.200.27 адрес сети равен 215.181.192.0. Чему равно наибольшее возможное значение третьего слева байта маски? Ответ запишите в виде десятичного числа."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "fd844923",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0b11001000\n",
      "0b11000000\n"
     ]
    }
   ],
   "source": [
    "print(bin(200))\n",
    "print(bin(192))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "e087ce87",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "240"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "int('11110000', 2)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
